In [1]:
print("hello")

hello

In [2]:
print(1+1)

2

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
# add a new column
df["new"] = df["W"]+df["Y"]

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
# for removing a column 
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# to permanently remove the row
df.drop("E",axis=0,inplace=True)

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
# selecting rows 
# is also a series 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [29]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [30]:
df.loc["B","Y"]# for the row "B" and the "Y" column

-0.8480769834036315

In [31]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [32]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [33]:
booldf = df>0

In [34]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df["W"]>0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [37]:
# only get conditio which is true 
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [41]:
# giving two condintion in the data frame 
# we can't use and in between them 

df[(df["W"]>0) & (df["Y"]<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df["new"]=  df["W"]+df["Y"]

In [43]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [16]:
df_with_index = df.reset_index()

In [18]:
df_with_index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
newind = " CA NY WY OR CO".split()

In [21]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [22]:
df["STATES"]= newind

In [23]:
df

          W         X         Y         Z STATES
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [25]:
# TO SET A COLUMN AS AN INDEX
df.set_index("STATES")

               W         X         Y         Z
STATES
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [26]:
df[(df["W"]>0) | (df["Y"]<0)]

          W         X         Y         Z STATES
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

# Third-Part

In [29]:
 # Index Levels
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
heir_index = list(zip(outside,inside))
heir_index = pd.MultiIndex.from_tuples(heir_index)

In [31]:
df =  pd.DataFrame(randn(6,2),heir_index,["A","B"])

In [32]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [36]:
df.loc["G1"]

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [37]:
df["A"]

G1  1    0.302665
    2   -1.706086
    3   -0.134841
G2  1    0.166905
    2    0.807706
    3    0.638787
Name: A, dtype: float64

In [38]:
df.index.names = ["Groups","Num"]

In [39]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [42]:
df.loc["G2"]["B"].loc[2]

0.07295967531703869

In [45]:
df.loc["G1"]["B"].loc[1]

1.693722925204035

In [46]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [47]:
df.xs(1,level ="Num")# will all the values in the num level with 
position 1

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

Pandas-missingvalues

# Pandas-missingvalues

In [48]:
import numpy as np
import pandas as pd

In [6]:
dict = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [7]:
df = pd.DataFrame(dict)

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [52]:
# for droping the row with the na values

In [53]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
# for droping a na valueo in the column

In [55]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [57]:
df.dropna(thresh=2)# when th erow will have
# two na values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [58]:
# how to fillin these missing values

In [59]:
df.fillna(value="FILL VALUES")

             A            B  C
0          1.0          5.0  1
1          2.0  FILL VALUES  2
2  FILL VALUES  FILL VALUES  3

In [9]:
 df["A"].fillna(value=df["A"].mean())#replace na vallue
# mean of the series

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [66]:
import numpy as np
import pandas as pd

In [79]:
data = {"company":["GOOG","GOOG","MSFT","MSFT","FB","FB"],
           "Person":["sam","charle","amy","Vnessa","Carl","Sarah"],
           "Sales":[200,120,340,124,243,350]}

In [1]:
df = pd.DataFrame(data)

NameError: name 'pd' is not defined

In [81]:
df

  company  Person  Sales
0    GOOG     sam    200
1    GOOG  charle    120
2    MSFT     amy    340
3    MSFT  Vnessa    124
4      FB    Carl    243
5      FB   Sarah    350

In [82]:
bycomp = df.groupby("company")

In [83]:
bycomp  #this is a object

In [84]:
bycomp.sum()

            Person  Sales
company
FB       CarlSarah    593
GOOG     samcharle    320
MSFT     amyVnessa    464

In [86]:
df.groupby("company").sum().loc["FB"]# all in one line

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [88]:
bycomp

In [89]:
df.groupby("company").count()

         Person  Sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [90]:
df.groupby("company").max()

        Person  Sales
company
FB       Sarah    350
GOOG       sam    200
MSFT       amy    340

In [91]:
df.groupby("company").min()

         Person  Sales
company
FB         Carl    243
GOOG     charle    120
MSFT     Vnessa    124

In [92]:
# for all of these in one format

In [93]:
df.groupby("company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# OPERATIONS

In [98]:
import numpy as np
import pandas as pd

In [99]:
df = pd.DataFrame({"col1":[1,2,3,4],
                    "col2":[444,555,666,444],
                      "col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [100]:
# finding unique values

In [102]:
df['col2'].unique() # gives a array of unique values

array([444, 555, 666], dtype=int64)

In [103]:
df["col2"].nunique()

3

In [107]:
df["col2"].value_counts() # the number of times the value 
# is occured

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [108]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [109]:
# conditional selection

In [111]:
df["col1"]>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [112]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [113]:
# double conditional statement

In [114]:
df[(df["col1"]>2) & (df["col2"]==444)]

   col1  col2 col3
3     4   444  xyz

In [115]:
# how to apply a custom function on the series

In [116]:
def times2(x):
    return x*2

In [118]:
df["col2"].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [121]:
df["col3"].apply(len) # specialy for the string

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [122]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [123]:
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [125]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [127]:
df.sort_values("col2") # sorting by values

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi